//#include <stdafx.h>
#include <iostream>
#include <conio.h>
#include <locale>

using namespace std;

void main()
{

   char alf[33] = { 'а','б','в','г','д','е','є','ж','з','и','і','ї','й','к','л','м','н','о','п','р','с','т','у','ф','х','ц','ч','ш','щ','ь','ю','я',' ' };
   char alf1[33] = { 'я','ю','ь','щ','ш','ч','ц','х','ф','у','т','с','р','п','о','н','м','л','к','й','ї','і','и','з','ж','є','е','д','г','в','б','а',' ' };
   char B[32];

   int k = 0, n = 0, m = 0;

   cout << "Enter the line\n"; //Ввод
   cin.getline(B, 32);
   for (k = 0; k < 32; k++) //цикл для букв слова
   {
      for (n = 0; n < 32; n++)//цикл для 1 алфавита
      {
         for (m = 0; m < 32; m++)//цикл для 2 алфавита
         {
            if (B[k] == alf[n])//если в слове есть элементы алфавита
            {
               // то присвоить элементам алфавита 1 элементы алфавита 2
               alf[n] = alf1[m];
               n = m;
               // присвоить буквам слова буквы алфавита 2
               B[k] = alf[n];
               k = n;
            }
         }
      }
   }

   cout << B << endl;
   cout << k << endl;
   _getch();
   system("pause");
}